tests/resources/directpayment/getEncryptionKey/getEncryptionKeyRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://impl.ws.payline.experian.com">
    <SOAP-ENV:Body>
        <ns1:getEncryptionKeyRequest>
            <ns1:version>90</ns1:version>
            <ns1:merchantKeyName>merchantKeyName xxx</ns1:merchantKeyName>
        </ns1:getEncryptionKeyRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>